zk017/NRF52832_FDS/main.c
       case FDS_EVT_WRITE:
              if (p_fds_evt->result == FDS_SUCCESS)
             {
                     write_flag=1;
                     NRF_LOG_PRINTF("FDS Write ok\n");
             }
            break;

case FDS_EVT_DEL_RECORD:
        if (p_fds_evt->result == FDS_SUCCESS)
         {
                delete_flag=1;
                NRF_LOG_PRINTF("FDS Delete Rec ok\n");
         }
         break;
default:
         break;

    }
}

//--------------------------------------------------------------------------------------------
ret_code_t fds_test_init (void)
{
     ret_code_t ret = fds_register(fds_evt_handler);
    if (ret != FDS_SUCCESS)
     {
          return ret;
     }
     ret = fds_init();
     if (ret != FDS_SUCCESS)
    {
           return ret;
      }
    NRF_LOG_PRINTF("fds_test_init return ok\n");
    return NRF_SUCCESS;

}

//======================================================================================
uint32_t zk_fds_write(uint16_t file_id, uint16_t record_key, uint8_t wrt_data[], uint16_t bytes)
{
       fds_record_t record;
       fds_record_desc_t record_desc;

      // Set up record.
      record.file_id = file_id;
      record.key = record_key;
      record.data.p_data = wrt_data; //&m_deadbeef;
      record.data.length_words = (bytes+3)/ sizeof(uint32_t); //sizeof(m_deadbeef)/sizeof(uint8_t);

      ret_code_t ret = fds_record_write(&record_desc, &record);
      if (ret != FDS_SUCCESS)
     {
            return ret;
      }
      NRF_LOG_INFO("Writing Record ID = %d ,words=%d\r\n",record_desc.record_id, record.data.length_words);
      return NRF_SUCCESS;
}
//---------------------------------------------------------------------------------------------
uint32_t zk_fds_read(uint16_t file_id, uint16_t record_key)
{

	fds_flash_record_t flash_record;
	fds_record_desc_t record_desc={0};
	fds_find_token_t ftok ={0};//Important, make sure you zero init the ftok token
	uint8_t data[13]={0};
	uint32_t err_code;

	//memset(&ftok, 0x00, sizeof(fds_find_token_t));

	NRF_LOG_INFO("Start searching... \r\n");
	// Loop until all records with the given key and file ID have been found.
	while (fds_record_find(file_id, record_key, &record_desc, &ftok) == FDS_SUCCESS)
	{
		err_code = fds_record_open(&record_desc, &flash_record);
		if ( err_code != FDS_SUCCESS)
		{
			return err_code; 
		}

		NRF_LOG_PRINTF("Found Record ID = %d\r\n",record_desc.record_id );
		NRF_LOG_PRINTF("Data = ");
		uint8_t nsize = 12;
		memcpy(data, flash_record.p_data, nsize);
		NRF_LOG_PRINTF("0x%x 0x%x 0x%x\r\n", data[0], data[1], data[11]);
		// Access the record through the flash_record structure.
		// Close the record when done.
		err_code = fds_record_close(&record_desc);
		if (err_code != FDS_SUCCESS)
		{
			return err_code; 
		}
	}
	return NRF_SUCCESS;

}

/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    leds_init();
    timers_init();
    log_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
//	init_hx711();
	
	
    // Start execution.
    
    advertising_start();
	NRF_LOG_PRINTF("Blinky example started.\n");
	//---------------------------------------------
	uint32_t err_code = 0;
	err_code = fds_test_init();
	while(err_code != NRF_SUCCESS);

	#if 0//tag0 ---write 3 records
	uint8_t a_buf[12]={1,2,3,4,5,6,7,8,9,10, 11, 12};
	write_flag = 0;
	err_code = zk_fds_write(afile_id, 1, a_buf, 12); //write record 1 -a_buf[10], record key as 1
	while(err_code != NRF_SUCCESS);
	//while(write_flag==0);

	uint8_t b_buf[12]= {0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1A, 0x1B};
	err_code = zk_fds_write(afile_id, 2, b_buf, 12);//write record 2 -b_buf[10], record key as 2
	while(err_code != NRF_SUCCESS);

	uint8_t c_buf[12]= {0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x3A, 0x3B};
	err_code = zk_fds_write(afile_id, 3, c_buf, 12);//write record 3 -c_buf[10], record key as 3
	while(err_code != NRF_SUCCESS);
	#else

	NRF_LOG_PRINTF("Read record:.\n");  //Read the 3 records
	err_code = zk_fds_read(afile_id, 1); //Read record 1 by record key ==1
	while(err_code != NRF_SUCCESS);
	err_code = zk_fds_read(afile_id, 2);//Read record  2 by record key ==2
	while(err_code != NRF_SUCCESS);
	err_code = zk_fds_read(afile_id, 3);//Read record 3 by record key ==3
	while(err_code != NRF_SUCCESS){};
	
	#endif
//----------------------------------------------
	
    // Enter main loop.
    for (;;)
    {
		//HX711_Read();
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */

